//Question 1
//export and import difference? 

/*
export হলো অন্য কোন ফাইল এর জন্য নিজেকে ওপেন করে দেওয়া বা ফ্রি করে দেওয়া! আর import হল যারা অলরেডি ওপেন আছে বা export অবস্থায় আছে তাদেরকে নিজের ভিতরে import করা। 

এক কথায় বলতে গেলে export অন্যকে সাহায্য করা। আর import অন্যের কাছ থেকে সাহায্য গ্রহণ করা! 
*/



//Question 2
//default export কি এবং ইমপোর্ট করার সময় কি কি সুবিধা আছে? 

/* default export হল, import করার সময় ইচ্ছ মত নাম দিয়ে import করার সুযোগ। 

এতে করে আমরা নিজের মতো করে যেকোনো নাম দিতে পারি। 

আমরা যেকোনো ফাইলের ভিতর default export একটি ব্যবহার করতে পারব। একের অধিক ব্যবহার কর যাবে না। */



//Question 3
//as কিওয়ার্ড কিভাবে নাম পরিবর্তন করতে সাহায্য করে? 

//as Keyword সাধারণত কোন নামকে পরিবর্তন করার জন্য ব্যবহার করা হয়। 
// math.js ফাইলের ভেতরে ফাংশনের নাম দেওয়া থাকলে। import করার সময় as কিওয়ার্ড ব্যবহার করে তার নাম আমরা পরিবর্তন করে দিতে পারি। 


//Question 4
//export আর default export এর ভিতর পার্থক্য কি? 


/* 
export কিওয়ার্ড ব্যবহার করলে আমরা নাম পরিবর্তন করতে পারি না। কিন্তু অন্যদিকে যদি আমরা default export কিওয়ার্ড ব্যবহার করি তাহলে আমরা আমাদের ইচ্ছামতো নাম পরিবর্তন করতে পারবো।
*/


//Question 5
//এক ফাইলে একাধিক default export কি সম্ভব? 
/*
না! এক ফাইলে একাধিক default export সম্ভব না। কারন আমরা যে কোন ফাইলে একটাই default export ব্যবহার করতে পারি। 
তাই একটা ফাইলে একাধিক default export ব্যবহার করা সম্ভব নয়।
*/